import React from 'react'
import './About.css'

import about_img from '../../assets/about.jpg'
import play_icon from '../../assets/play.png'

const About = ({ setPlayState }) => {
  return (
    <div className='about'>
      <div className="about-left">

        <img src={about_img} className="about-img" alt='' />
        <img src={play_icon} className="play-icon" alt='' onClick={() => {
          setPlayState(true)
        }} />

      </div>

      <div className="about-right">
        <h3>دەربارەی ڕێکخراو</h3>
        <h2>ڕێکخراوی سەدەقە کاری سەربڕینی حەیوان ئەنجام ئەدات لە ئەفریقا</h2>
        <p>هەندێ خۆشەویست دەپرسێت چۆن سیقە بکەین ودڵنیا بین ئەم حەوتمەمان لە ئەفریقا بۆ ئەنجام ئەدرێت.
          بەڕێزان ئەم عەقیقانە لە وڵاتی تەنزانیا ئەکرێت لە ئەفریقا بۆ مسوڵمانە هەژارەکانی ئەوێت
          کاتێ تۆ دەتەوێت عەقیقەیەک یان خێرێک بکەیت ناوت لەسەر وەرەقەیەک دەنوسن ئەوناوەی خۆت بۆمان دەنێریت وەپاشان چ دوعایەک خۆت دەینێری پێیان دەڵێن ئەو دوعایەت بۆ بکەن کاتێ مەڕەکە سەر  دەبڕن تەسویر ئەکرێت وناوت ئەخوێنێتەوە ئەم مەڕە حەوتمە بۆفڵانە کەس پاشان دوعات بۆ ئەکەن ئەو دوعایانەی خۆت دەتەوێت وناردوتە بەهەمان شێوە کاتی نان خواردنەکەش تەسوید دەکرێ وناوەکەت دەخوێنەوە.
          بەنیسبەت پارە ناردنەوە عەقیقەکەت بۆ ئەنجام ئەدرێ ئەوکات ئەتوانی پارەکە بنێریت بۆ ئەوەی   توشی دودڵی نەبیت لەوەی پارەکەت بفەوتێت.
          کەسێک دەڵێ ئەی ئێوە چۆن سیقە ئەکەن لەوانەیە ئەوکەسە پارەکە نەنێرێت؟
          کەسێک کەئەهلی خێربێت وحەوتم وخێر بکات پارەکەش ئەنێرێت ترسمان نیە وایە سەردەمەکە خراپە بەڵام مسوڵمان وئەهلی خێر سیقەیان هەیە..
          بەنیسبەت پارە ناردنەکەشەوە ئەتوانن بە فاست پەی بینێرن کە لەهەموو شاروشارۆچکەوە مارکێتەکان ودوکانەکانی موبایل هەیه ئەتوانی بینێریت پارەکەی.
          لەکۆتایدا ئێمە ئەوەمان پێباشە کە لەوڵاتی خۆت وحەوتم وخێر بکەیت بەڵام کەسێ فەقیرە وکرێچیە ناتوانێ لێرە حەوتم بۆمنداڵەکەی بکات لەوێ ئەتوانێ بەنرخێکی زۆر کەم ئەنجامی بدات لەوێ مەڕێک بە ئامادەکردنیشیەوە لەگەڵ برنج بە ۱۱۰ هەزارە
          هەر پرسیارێکتان هەیە ئەتوانن نامە بنێرن یان لەکۆمێنت بینوسن</p>
      </div>
    </div>
  )
}

export default About
